{
  "class_name": "Model", 
  "keras_version": "1.2.2", 
  "config": {
    "layers": [
      {
        "class_name": "InputLayer", 
        "inbound_nodes": [], 
        "config": {
          "batch_input_shape": [
            null, 
            3, 
            32, 
            32
          ], 
          "sparse": false, 
          "input_dtype": "float32", 
          "name": "input_1"
        }, 
        "name": "input_1"
      }, 
      {
        "class_name": "Sequential", 
        "inbound_nodes": [
          [
            [
              "input_1", 
              0, 
              0
            ]
          ]
        ], 
        "config": [
          {
            "class_name": "Convolution2D", 
            "config": {
              "batch_input_shape": [
                null, 
                3, 
                32, 
                32
              ], 
              "W_constraint": null, 
              "b_constraint": null, 
              "name": "conv1", 
              "activity_regularizer": null, 
              "trainable": true, 
              "dim_ordering": "th", 
              "nb_col": 3, 
              "subsample": [
                1, 
                1
              ], 
              "init": "glorot_uniform", 
              "bias": true, 
              "nb_filter": 64, 
              "input_dtype": "float32", 
              "border_mode": "same", 
              "b_regularizer": null, 
              "W_regularizer": null, 
              "activation": "relu", 
              "nb_row": 3
            }
          }, 
          {
            "class_name": "MaxPooling2D", 
            "config": {
              "name": "pool1", 
              "trainable": true, 
              "dim_ordering": "th", 
              "pool_size": [
                2, 
                2
              ], 
              "strides": [
                2, 
                2
              ], 
              "border_mode": "valid"
            }
          }, 
          {
            "class_name": "Dropout", 
            "config": {
              "p": 0.25, 
              "trainable": true, 
              "name": "dropout_1"
            }
          }, 
          {
            "class_name": "Convolution2D", 
            "config": {
              "W_constraint": null, 
              "b_constraint": null, 
              "name": "conv2", 
              "activity_regularizer": null, 
              "trainable": true, 
              "dim_ordering": "th", 
              "nb_col": 3, 
              "subsample": [
                1, 
                1
              ], 
              "init": "glorot_uniform", 
              "bias": true, 
              "nb_filter": 64, 
              "border_mode": "same", 
              "b_regularizer": null, 
              "W_regularizer": null, 
              "activation": "relu", 
              "nb_row": 3
            }
          }, 
          {
            "class_name": "MaxPooling2D", 
            "config": {
              "name": "pool2", 
              "trainable": true, 
              "dim_ordering": "th", 
              "pool_size": [
                2, 
                2
              ], 
              "strides": [
                2, 
                2
              ], 
              "border_mode": "valid"
            }
          }, 
          {
            "class_name": "Dropout", 
            "config": {
              "p": 0.25, 
              "trainable": true, 
              "name": "dropout_2"
            }
          }, 
          {
            "class_name": "Flatten", 
            "config": {
              "trainable": true, 
              "name": "flatten"
            }
          }, 
          {
            "class_name": "Dense", 
            "config": {
              "W_constraint": null, 
              "b_constraint": null, 
              "name": "fc1", 
              "activity_regularizer": null, 
              "trainable": true, 
              "init": "glorot_uniform", 
              "bias": true, 
              "input_dim": 4096, 
              "b_regularizer": null, 
              "W_regularizer": null, 
              "activation": "relu", 
              "output_dim": 64
            }
          }, 
          {
            "class_name": "Dropout", 
            "config": {
              "p": 0.5, 
              "trainable": true, 
              "name": "dropout_3"
            }
          }, 
          {
            "class_name": "Dense", 
            "config": {
              "W_constraint": null, 
              "b_constraint": null, 
              "name": "fc2", 
              "activity_regularizer": null, 
              "trainable": true, 
              "init": "glorot_uniform", 
              "bias": true, 
              "input_dim": 64, 
              "b_regularizer": null, 
              "W_regularizer": null, 
              "activation": "linear", 
              "output_dim": 10
            }
          }
        ], 
        "name": "sequential_1"
      }, 
      {
        "class_name": "Activation", 
        "inbound_nodes": [
          [
            [
              "sequential_1", 
              1, 
              0
            ]
          ]
        ], 
        "config": {
          "activation": "softmax", 
          "trainable": true, 
          "name": "activation_1"
        }, 
        "name": "activation_1"
      }
    ], 
    "input_layers": [
      [
        "input_1", 
        0, 
        0
      ]
    ], 
    "name": "model_1", 
    "output_layers": [
      [
        "sequential_1", 
        1, 
        0
      ], 
      [
        "activation_1", 
        0, 
        0
      ]
    ]
  }
}