{
  "class_name": "Model", 
  "keras_version": "1.2.2", 
  "config": {
    "layers": [
      {
        "class_name": "InputLayer", 
        "inbound_nodes": [], 
        "config": {
          "batch_input_shape": [
            null, 
            3, 
            32, 
            32
          ], 
          "sparse": false, 
          "input_dtype": "float32", 
          "name": "input_1"
        }, 
        "name": "input_1"
      }, 
      {
        "class_name": "Convolution2D", 
        "inbound_nodes": [
          [
            [
              "input_1", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "W_constraint": null, 
          "b_constraint": null, 
          "name": "conv1", 
          "activity_regularizer": null, 
          "trainable": true, 
          "dim_ordering": "th", 
          "nb_col": 3, 
          "subsample": [
            1, 
            1
          ], 
          "init": "glorot_uniform", 
          "bias": true, 
          "nb_filter": 128, 
          "b_regularizer": null, 
          "W_regularizer": null, 
          "nb_row": 3, 
          "activation": "relu", 
          "border_mode": "same"
        }, 
        "name": "conv1"
      }, 
      {
        "class_name": "MaxPooling2D", 
        "inbound_nodes": [
          [
            [
              "conv1", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "name": "pool1", 
          "trainable": true, 
          "dim_ordering": "th", 
          "pool_size": [
            2, 
            2
          ], 
          "strides": [
            2, 
            2
          ], 
          "border_mode": "valid"
        }, 
        "name": "pool1"
      }, 
      {
        "class_name": "Dropout", 
        "inbound_nodes": [
          [
            [
              "pool1", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "p": 0.25, 
          "trainable": true, 
          "name": "dropout_1"
        }, 
        "name": "dropout_1"
      }, 
      {
        "class_name": "Convolution2D", 
        "inbound_nodes": [
          [
            [
              "dropout_1", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "W_constraint": null, 
          "b_constraint": null, 
          "name": "conv2", 
          "activity_regularizer": null, 
          "trainable": true, 
          "dim_ordering": "th", 
          "nb_col": 3, 
          "subsample": [
            1, 
            1
          ], 
          "init": "glorot_uniform", 
          "bias": true, 
          "nb_filter": 64, 
          "b_regularizer": null, 
          "W_regularizer": null, 
          "nb_row": 3, 
          "activation": "relu", 
          "border_mode": "same"
        }, 
        "name": "conv2"
      }, 
      {
        "class_name": "MaxPooling2D", 
        "inbound_nodes": [
          [
            [
              "conv2", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "name": "pool2", 
          "trainable": true, 
          "dim_ordering": "th", 
          "pool_size": [
            2, 
            2
          ], 
          "strides": [
            2, 
            2
          ], 
          "border_mode": "valid"
        }, 
        "name": "pool2"
      }, 
      {
        "class_name": "Dropout", 
        "inbound_nodes": [
          [
            [
              "pool2", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "p": 0.25, 
          "trainable": true, 
          "name": "dropout_2"
        }, 
        "name": "dropout_2"
      }, 
      {
        "class_name": "Flatten", 
        "inbound_nodes": [
          [
            [
              "dropout_2", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "trainable": true, 
          "name": "flatten"
        }, 
        "name": "flatten"
      }, 
      {
        "class_name": "Dense", 
        "inbound_nodes": [
          [
            [
              "flatten", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "W_constraint": null, 
          "b_constraint": null, 
          "name": "fc1", 
          "activity_regularizer": null, 
          "trainable": true, 
          "init": "glorot_uniform", 
          "bias": true, 
          "activation": "relu", 
          "input_dtype": "float32", 
          "input_dim": 4096, 
          "b_regularizer": null, 
          "W_regularizer": null, 
          "output_dim": 64, 
          "batch_input_shape": [
            null, 
            4096
          ]
        }, 
        "name": "fc1"
      }, 
      {
        "class_name": "Dropout", 
        "inbound_nodes": [
          [
            [
              "fc1", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "p": 0.5, 
          "trainable": true, 
          "name": "dropout_3"
        }, 
        "name": "dropout_3"
      }, 
      {
        "class_name": "Dense", 
        "inbound_nodes": [
          [
            [
              "dropout_3", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "W_constraint": null, 
          "b_constraint": null, 
          "name": "logits", 
          "activity_regularizer": null, 
          "trainable": true, 
          "init": "glorot_uniform", 
          "bias": true, 
          "activation": "linear", 
          "input_dtype": "float32", 
          "input_dim": 64, 
          "b_regularizer": null, 
          "W_regularizer": null, 
          "output_dim": 10, 
          "batch_input_shape": [
            null, 
            64
          ]
        }, 
        "name": "logits"
      }, 
      {
        "class_name": "Activation", 
        "inbound_nodes": [
          [
            [
              "logits", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "activation": "softmax", 
          "trainable": true, 
          "name": "softmax"
        }, 
        "name": "softmax"
      }
    ], 
    "input_layers": [
      [
        "input_1", 
        0, 
        0
      ]
    ], 
    "name": "model_1", 
    "output_layers": [
      [
        "logits", 
        0, 
        0
      ], 
      [
        "softmax", 
        0, 
        0
      ]
    ]
  }
}