{
  "class_name": "Model", 
  "keras_version": "1.2.2", 
  "config": {
    "layers": [
      {
        "class_name": "InputLayer", 
        "inbound_nodes": [], 
        "config": {
          "batch_input_shape": [
            null, 
            3, 
            32, 
            32
          ], 
          "sparse": false, 
          "input_dtype": "float32", 
          "name": "input_1"
        }, 
        "name": "input_1"
      }, 
      {
        "class_name": "Convolution2D", 
        "inbound_nodes": [
          [
            [
              "input_1", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "W_constraint": null, 
          "b_constraint": null, 
          "name": "convolution2d_1", 
          "activity_regularizer": null, 
          "trainable": true, 
          "dim_ordering": "th", 
          "nb_col": 7, 
          "subsample": [
            2, 
            2
          ], 
          "init": "he_normal", 
          "bias": true, 
          "nb_filter": 64, 
          "b_regularizer": null, 
          "W_regularizer": {
            "l2": 9.999999747378752e-05, 
            "name": "L1L2Regularizer", 
            "l1": 0.0
          }, 
          "nb_row": 7, 
          "activation": "linear", 
          "border_mode": "same"
        }, 
        "name": "convolution2d_1"
      }, 
      {
        "class_name": "BatchNormalization", 
        "inbound_nodes": [
          [
            [
              "convolution2d_1", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "gamma_regularizer": null, 
          "name": "batchnormalization_1", 
          "epsilon": 0.001, 
          "trainable": true, 
          "mode": 0, 
          "beta_regularizer": null, 
          "momentum": 0.99, 
          "axis": 1
        }, 
        "name": "batchnormalization_1"
      }, 
      {
        "class_name": "Activation", 
        "inbound_nodes": [
          [
            [
              "batchnormalization_1", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "activation": "relu", 
          "trainable": true, 
          "name": "activation_1"
        }, 
        "name": "activation_1"
      }, 
      {
        "class_name": "MaxPooling2D", 
        "inbound_nodes": [
          [
            [
              "activation_1", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "name": "maxpooling2d_1", 
          "trainable": true, 
          "dim_ordering": "th", 
          "pool_size": [
            3, 
            3
          ], 
          "strides": [
            2, 
            2
          ], 
          "border_mode": "same"
        }, 
        "name": "maxpooling2d_1"
      }, 
      {
        "class_name": "Convolution2D", 
        "inbound_nodes": [
          [
            [
              "maxpooling2d_1", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "W_constraint": null, 
          "b_constraint": null, 
          "name": "convolution2d_2", 
          "activity_regularizer": null, 
          "trainable": true, 
          "dim_ordering": "th", 
          "nb_col": 3, 
          "subsample": [
            1, 
            1
          ], 
          "init": "he_normal", 
          "bias": true, 
          "nb_filter": 64, 
          "b_regularizer": null, 
          "W_regularizer": {
            "l2": 9.999999747378752e-05, 
            "name": "L1L2Regularizer", 
            "l1": 0.0
          }, 
          "nb_row": 3, 
          "activation": "linear", 
          "border_mode": "same"
        }, 
        "name": "convolution2d_2"
      }, 
      {
        "class_name": "BatchNormalization", 
        "inbound_nodes": [
          [
            [
              "convolution2d_2", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "gamma_regularizer": null, 
          "name": "batchnormalization_2", 
          "epsilon": 0.001, 
          "trainable": true, 
          "mode": 0, 
          "beta_regularizer": null, 
          "momentum": 0.99, 
          "axis": 1
        }, 
        "name": "batchnormalization_2"
      }, 
      {
        "class_name": "Activation", 
        "inbound_nodes": [
          [
            [
              "batchnormalization_2", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "activation": "relu", 
          "trainable": true, 
          "name": "activation_2"
        }, 
        "name": "activation_2"
      }, 
      {
        "class_name": "Convolution2D", 
        "inbound_nodes": [
          [
            [
              "activation_2", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "W_constraint": null, 
          "b_constraint": null, 
          "name": "convolution2d_3", 
          "activity_regularizer": null, 
          "trainable": true, 
          "dim_ordering": "th", 
          "nb_col": 3, 
          "subsample": [
            1, 
            1
          ], 
          "init": "he_normal", 
          "bias": true, 
          "nb_filter": 64, 
          "b_regularizer": null, 
          "W_regularizer": {
            "l2": 9.999999747378752e-05, 
            "name": "L1L2Regularizer", 
            "l1": 0.0
          }, 
          "nb_row": 3, 
          "activation": "linear", 
          "border_mode": "same"
        }, 
        "name": "convolution2d_3"
      }, 
      {
        "class_name": "Merge", 
        "inbound_nodes": [
          [
            [
              "maxpooling2d_1", 
              0, 
              0
            ], 
            [
              "convolution2d_3", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "name": "merge_1", 
          "concat_axis": -1, 
          "output_shape_type": "raw", 
          "mode_type": "raw", 
          "dot_axes": -1, 
          "output_mask_type": "raw", 
          "arguments": {}, 
          "output_mask": null, 
          "output_shape": null, 
          "mode": "sum"
        }, 
        "name": "merge_1"
      }, 
      {
        "class_name": "BatchNormalization", 
        "inbound_nodes": [
          [
            [
              "merge_1", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "gamma_regularizer": null, 
          "name": "batchnormalization_3", 
          "epsilon": 0.001, 
          "trainable": true, 
          "mode": 0, 
          "beta_regularizer": null, 
          "momentum": 0.99, 
          "axis": 1
        }, 
        "name": "batchnormalization_3"
      }, 
      {
        "class_name": "Activation", 
        "inbound_nodes": [
          [
            [
              "batchnormalization_3", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "activation": "relu", 
          "trainable": true, 
          "name": "activation_3"
        }, 
        "name": "activation_3"
      }, 
      {
        "class_name": "Convolution2D", 
        "inbound_nodes": [
          [
            [
              "activation_3", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "W_constraint": null, 
          "b_constraint": null, 
          "name": "convolution2d_4", 
          "activity_regularizer": null, 
          "trainable": true, 
          "dim_ordering": "th", 
          "nb_col": 3, 
          "subsample": [
            1, 
            1
          ], 
          "init": "he_normal", 
          "bias": true, 
          "nb_filter": 64, 
          "b_regularizer": null, 
          "W_regularizer": {
            "l2": 9.999999747378752e-05, 
            "name": "L1L2Regularizer", 
            "l1": 0.0
          }, 
          "nb_row": 3, 
          "activation": "linear", 
          "border_mode": "same"
        }, 
        "name": "convolution2d_4"
      }, 
      {
        "class_name": "BatchNormalization", 
        "inbound_nodes": [
          [
            [
              "convolution2d_4", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "gamma_regularizer": null, 
          "name": "batchnormalization_4", 
          "epsilon": 0.001, 
          "trainable": true, 
          "mode": 0, 
          "beta_regularizer": null, 
          "momentum": 0.99, 
          "axis": 1
        }, 
        "name": "batchnormalization_4"
      }, 
      {
        "class_name": "Activation", 
        "inbound_nodes": [
          [
            [
              "batchnormalization_4", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "activation": "relu", 
          "trainable": true, 
          "name": "activation_4"
        }, 
        "name": "activation_4"
      }, 
      {
        "class_name": "Convolution2D", 
        "inbound_nodes": [
          [
            [
              "activation_4", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "W_constraint": null, 
          "b_constraint": null, 
          "name": "convolution2d_5", 
          "activity_regularizer": null, 
          "trainable": true, 
          "dim_ordering": "th", 
          "nb_col": 3, 
          "subsample": [
            1, 
            1
          ], 
          "init": "he_normal", 
          "bias": true, 
          "nb_filter": 64, 
          "b_regularizer": null, 
          "W_regularizer": {
            "l2": 9.999999747378752e-05, 
            "name": "L1L2Regularizer", 
            "l1": 0.0
          }, 
          "nb_row": 3, 
          "activation": "linear", 
          "border_mode": "same"
        }, 
        "name": "convolution2d_5"
      }, 
      {
        "class_name": "Merge", 
        "inbound_nodes": [
          [
            [
              "merge_1", 
              0, 
              0
            ], 
            [
              "convolution2d_5", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "name": "merge_2", 
          "concat_axis": -1, 
          "output_shape_type": "raw", 
          "mode_type": "raw", 
          "dot_axes": -1, 
          "output_mask_type": "raw", 
          "arguments": {}, 
          "output_mask": null, 
          "output_shape": null, 
          "mode": "sum"
        }, 
        "name": "merge_2"
      }, 
      {
        "class_name": "BatchNormalization", 
        "inbound_nodes": [
          [
            [
              "merge_2", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "gamma_regularizer": null, 
          "name": "batchnormalization_5", 
          "epsilon": 0.001, 
          "trainable": true, 
          "mode": 0, 
          "beta_regularizer": null, 
          "momentum": 0.99, 
          "axis": 1
        }, 
        "name": "batchnormalization_5"
      }, 
      {
        "class_name": "Activation", 
        "inbound_nodes": [
          [
            [
              "batchnormalization_5", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "activation": "relu", 
          "trainable": true, 
          "name": "activation_5"
        }, 
        "name": "activation_5"
      }, 
      {
        "class_name": "Convolution2D", 
        "inbound_nodes": [
          [
            [
              "activation_5", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "W_constraint": null, 
          "b_constraint": null, 
          "name": "convolution2d_6", 
          "activity_regularizer": null, 
          "trainable": true, 
          "dim_ordering": "th", 
          "nb_col": 3, 
          "subsample": [
            2, 
            2
          ], 
          "init": "he_normal", 
          "bias": true, 
          "nb_filter": 128, 
          "b_regularizer": null, 
          "W_regularizer": {
            "l2": 9.999999747378752e-05, 
            "name": "L1L2Regularizer", 
            "l1": 0.0
          }, 
          "nb_row": 3, 
          "activation": "linear", 
          "border_mode": "same"
        }, 
        "name": "convolution2d_6"
      }, 
      {
        "class_name": "BatchNormalization", 
        "inbound_nodes": [
          [
            [
              "convolution2d_6", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "gamma_regularizer": null, 
          "name": "batchnormalization_6", 
          "epsilon": 0.001, 
          "trainable": true, 
          "mode": 0, 
          "beta_regularizer": null, 
          "momentum": 0.99, 
          "axis": 1
        }, 
        "name": "batchnormalization_6"
      }, 
      {
        "class_name": "Activation", 
        "inbound_nodes": [
          [
            [
              "batchnormalization_6", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "activation": "relu", 
          "trainable": true, 
          "name": "activation_6"
        }, 
        "name": "activation_6"
      }, 
      {
        "class_name": "Convolution2D", 
        "inbound_nodes": [
          [
            [
              "merge_2", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "W_constraint": null, 
          "b_constraint": null, 
          "name": "convolution2d_8", 
          "activity_regularizer": null, 
          "trainable": true, 
          "dim_ordering": "th", 
          "nb_col": 1, 
          "subsample": [
            2, 
            2
          ], 
          "init": "he_normal", 
          "bias": true, 
          "nb_filter": 128, 
          "b_regularizer": null, 
          "W_regularizer": {
            "l2": 9.999999747378752e-05, 
            "name": "L1L2Regularizer", 
            "l1": 0.0
          }, 
          "nb_row": 1, 
          "activation": "linear", 
          "border_mode": "valid"
        }, 
        "name": "convolution2d_8"
      }, 
      {
        "class_name": "Convolution2D", 
        "inbound_nodes": [
          [
            [
              "activation_6", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "W_constraint": null, 
          "b_constraint": null, 
          "name": "convolution2d_7", 
          "activity_regularizer": null, 
          "trainable": true, 
          "dim_ordering": "th", 
          "nb_col": 3, 
          "subsample": [
            1, 
            1
          ], 
          "init": "he_normal", 
          "bias": true, 
          "nb_filter": 128, 
          "b_regularizer": null, 
          "W_regularizer": {
            "l2": 9.999999747378752e-05, 
            "name": "L1L2Regularizer", 
            "l1": 0.0
          }, 
          "nb_row": 3, 
          "activation": "linear", 
          "border_mode": "same"
        }, 
        "name": "convolution2d_7"
      }, 
      {
        "class_name": "Merge", 
        "inbound_nodes": [
          [
            [
              "convolution2d_8", 
              0, 
              0
            ], 
            [
              "convolution2d_7", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "name": "merge_3", 
          "concat_axis": -1, 
          "output_shape_type": "raw", 
          "mode_type": "raw", 
          "dot_axes": -1, 
          "output_mask_type": "raw", 
          "arguments": {}, 
          "output_mask": null, 
          "output_shape": null, 
          "mode": "sum"
        }, 
        "name": "merge_3"
      }, 
      {
        "class_name": "BatchNormalization", 
        "inbound_nodes": [
          [
            [
              "merge_3", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "gamma_regularizer": null, 
          "name": "batchnormalization_7", 
          "epsilon": 0.001, 
          "trainable": true, 
          "mode": 0, 
          "beta_regularizer": null, 
          "momentum": 0.99, 
          "axis": 1
        }, 
        "name": "batchnormalization_7"
      }, 
      {
        "class_name": "Activation", 
        "inbound_nodes": [
          [
            [
              "batchnormalization_7", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "activation": "relu", 
          "trainable": true, 
          "name": "activation_7"
        }, 
        "name": "activation_7"
      }, 
      {
        "class_name": "Convolution2D", 
        "inbound_nodes": [
          [
            [
              "activation_7", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "W_constraint": null, 
          "b_constraint": null, 
          "name": "convolution2d_9", 
          "activity_regularizer": null, 
          "trainable": true, 
          "dim_ordering": "th", 
          "nb_col": 3, 
          "subsample": [
            1, 
            1
          ], 
          "init": "he_normal", 
          "bias": true, 
          "nb_filter": 128, 
          "b_regularizer": null, 
          "W_regularizer": {
            "l2": 9.999999747378752e-05, 
            "name": "L1L2Regularizer", 
            "l1": 0.0
          }, 
          "nb_row": 3, 
          "activation": "linear", 
          "border_mode": "same"
        }, 
        "name": "convolution2d_9"
      }, 
      {
        "class_name": "BatchNormalization", 
        "inbound_nodes": [
          [
            [
              "convolution2d_9", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "gamma_regularizer": null, 
          "name": "batchnormalization_8", 
          "epsilon": 0.001, 
          "trainable": true, 
          "mode": 0, 
          "beta_regularizer": null, 
          "momentum": 0.99, 
          "axis": 1
        }, 
        "name": "batchnormalization_8"
      }, 
      {
        "class_name": "Activation", 
        "inbound_nodes": [
          [
            [
              "batchnormalization_8", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "activation": "relu", 
          "trainable": true, 
          "name": "activation_8"
        }, 
        "name": "activation_8"
      }, 
      {
        "class_name": "Convolution2D", 
        "inbound_nodes": [
          [
            [
              "activation_8", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "W_constraint": null, 
          "b_constraint": null, 
          "name": "convolution2d_10", 
          "activity_regularizer": null, 
          "trainable": true, 
          "dim_ordering": "th", 
          "nb_col": 3, 
          "subsample": [
            1, 
            1
          ], 
          "init": "he_normal", 
          "bias": true, 
          "nb_filter": 128, 
          "b_regularizer": null, 
          "W_regularizer": {
            "l2": 9.999999747378752e-05, 
            "name": "L1L2Regularizer", 
            "l1": 0.0
          }, 
          "nb_row": 3, 
          "activation": "linear", 
          "border_mode": "same"
        }, 
        "name": "convolution2d_10"
      }, 
      {
        "class_name": "Merge", 
        "inbound_nodes": [
          [
            [
              "merge_3", 
              0, 
              0
            ], 
            [
              "convolution2d_10", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "name": "merge_4", 
          "concat_axis": -1, 
          "output_shape_type": "raw", 
          "mode_type": "raw", 
          "dot_axes": -1, 
          "output_mask_type": "raw", 
          "arguments": {}, 
          "output_mask": null, 
          "output_shape": null, 
          "mode": "sum"
        }, 
        "name": "merge_4"
      }, 
      {
        "class_name": "BatchNormalization", 
        "inbound_nodes": [
          [
            [
              "merge_4", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "gamma_regularizer": null, 
          "name": "batchnormalization_9", 
          "epsilon": 0.001, 
          "trainable": true, 
          "mode": 0, 
          "beta_regularizer": null, 
          "momentum": 0.99, 
          "axis": 1
        }, 
        "name": "batchnormalization_9"
      }, 
      {
        "class_name": "Activation", 
        "inbound_nodes": [
          [
            [
              "batchnormalization_9", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "activation": "relu", 
          "trainable": true, 
          "name": "activation_9"
        }, 
        "name": "activation_9"
      }, 
      {
        "class_name": "Convolution2D", 
        "inbound_nodes": [
          [
            [
              "activation_9", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "W_constraint": null, 
          "b_constraint": null, 
          "name": "convolution2d_11", 
          "activity_regularizer": null, 
          "trainable": true, 
          "dim_ordering": "th", 
          "nb_col": 3, 
          "subsample": [
            2, 
            2
          ], 
          "init": "he_normal", 
          "bias": true, 
          "nb_filter": 256, 
          "b_regularizer": null, 
          "W_regularizer": {
            "l2": 9.999999747378752e-05, 
            "name": "L1L2Regularizer", 
            "l1": 0.0
          }, 
          "nb_row": 3, 
          "activation": "linear", 
          "border_mode": "same"
        }, 
        "name": "convolution2d_11"
      }, 
      {
        "class_name": "BatchNormalization", 
        "inbound_nodes": [
          [
            [
              "convolution2d_11", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "gamma_regularizer": null, 
          "name": "batchnormalization_10", 
          "epsilon": 0.001, 
          "trainable": true, 
          "mode": 0, 
          "beta_regularizer": null, 
          "momentum": 0.99, 
          "axis": 1
        }, 
        "name": "batchnormalization_10"
      }, 
      {
        "class_name": "Activation", 
        "inbound_nodes": [
          [
            [
              "batchnormalization_10", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "activation": "relu", 
          "trainable": true, 
          "name": "activation_10"
        }, 
        "name": "activation_10"
      }, 
      {
        "class_name": "Convolution2D", 
        "inbound_nodes": [
          [
            [
              "merge_4", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "W_constraint": null, 
          "b_constraint": null, 
          "name": "convolution2d_13", 
          "activity_regularizer": null, 
          "trainable": true, 
          "dim_ordering": "th", 
          "nb_col": 1, 
          "subsample": [
            2, 
            2
          ], 
          "init": "he_normal", 
          "bias": true, 
          "nb_filter": 256, 
          "b_regularizer": null, 
          "W_regularizer": {
            "l2": 9.999999747378752e-05, 
            "name": "L1L2Regularizer", 
            "l1": 0.0
          }, 
          "nb_row": 1, 
          "activation": "linear", 
          "border_mode": "valid"
        }, 
        "name": "convolution2d_13"
      }, 
      {
        "class_name": "Convolution2D", 
        "inbound_nodes": [
          [
            [
              "activation_10", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "W_constraint": null, 
          "b_constraint": null, 
          "name": "convolution2d_12", 
          "activity_regularizer": null, 
          "trainable": true, 
          "dim_ordering": "th", 
          "nb_col": 3, 
          "subsample": [
            1, 
            1
          ], 
          "init": "he_normal", 
          "bias": true, 
          "nb_filter": 256, 
          "b_regularizer": null, 
          "W_regularizer": {
            "l2": 9.999999747378752e-05, 
            "name": "L1L2Regularizer", 
            "l1": 0.0
          }, 
          "nb_row": 3, 
          "activation": "linear", 
          "border_mode": "same"
        }, 
        "name": "convolution2d_12"
      }, 
      {
        "class_name": "Merge", 
        "inbound_nodes": [
          [
            [
              "convolution2d_13", 
              0, 
              0
            ], 
            [
              "convolution2d_12", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "name": "merge_5", 
          "concat_axis": -1, 
          "output_shape_type": "raw", 
          "mode_type": "raw", 
          "dot_axes": -1, 
          "output_mask_type": "raw", 
          "arguments": {}, 
          "output_mask": null, 
          "output_shape": null, 
          "mode": "sum"
        }, 
        "name": "merge_5"
      }, 
      {
        "class_name": "BatchNormalization", 
        "inbound_nodes": [
          [
            [
              "merge_5", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "gamma_regularizer": null, 
          "name": "batchnormalization_11", 
          "epsilon": 0.001, 
          "trainable": true, 
          "mode": 0, 
          "beta_regularizer": null, 
          "momentum": 0.99, 
          "axis": 1
        }, 
        "name": "batchnormalization_11"
      }, 
      {
        "class_name": "Activation", 
        "inbound_nodes": [
          [
            [
              "batchnormalization_11", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "activation": "relu", 
          "trainable": true, 
          "name": "activation_11"
        }, 
        "name": "activation_11"
      }, 
      {
        "class_name": "Convolution2D", 
        "inbound_nodes": [
          [
            [
              "activation_11", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "W_constraint": null, 
          "b_constraint": null, 
          "name": "convolution2d_14", 
          "activity_regularizer": null, 
          "trainable": true, 
          "dim_ordering": "th", 
          "nb_col": 3, 
          "subsample": [
            1, 
            1
          ], 
          "init": "he_normal", 
          "bias": true, 
          "nb_filter": 256, 
          "b_regularizer": null, 
          "W_regularizer": {
            "l2": 9.999999747378752e-05, 
            "name": "L1L2Regularizer", 
            "l1": 0.0
          }, 
          "nb_row": 3, 
          "activation": "linear", 
          "border_mode": "same"
        }, 
        "name": "convolution2d_14"
      }, 
      {
        "class_name": "BatchNormalization", 
        "inbound_nodes": [
          [
            [
              "convolution2d_14", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "gamma_regularizer": null, 
          "name": "batchnormalization_12", 
          "epsilon": 0.001, 
          "trainable": true, 
          "mode": 0, 
          "beta_regularizer": null, 
          "momentum": 0.99, 
          "axis": 1
        }, 
        "name": "batchnormalization_12"
      }, 
      {
        "class_name": "Activation", 
        "inbound_nodes": [
          [
            [
              "batchnormalization_12", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "activation": "relu", 
          "trainable": true, 
          "name": "activation_12"
        }, 
        "name": "activation_12"
      }, 
      {
        "class_name": "Convolution2D", 
        "inbound_nodes": [
          [
            [
              "activation_12", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "W_constraint": null, 
          "b_constraint": null, 
          "name": "convolution2d_15", 
          "activity_regularizer": null, 
          "trainable": true, 
          "dim_ordering": "th", 
          "nb_col": 3, 
          "subsample": [
            1, 
            1
          ], 
          "init": "he_normal", 
          "bias": true, 
          "nb_filter": 256, 
          "b_regularizer": null, 
          "W_regularizer": {
            "l2": 9.999999747378752e-05, 
            "name": "L1L2Regularizer", 
            "l1": 0.0
          }, 
          "nb_row": 3, 
          "activation": "linear", 
          "border_mode": "same"
        }, 
        "name": "convolution2d_15"
      }, 
      {
        "class_name": "Merge", 
        "inbound_nodes": [
          [
            [
              "merge_5", 
              0, 
              0
            ], 
            [
              "convolution2d_15", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "name": "merge_6", 
          "concat_axis": -1, 
          "output_shape_type": "raw", 
          "mode_type": "raw", 
          "dot_axes": -1, 
          "output_mask_type": "raw", 
          "arguments": {}, 
          "output_mask": null, 
          "output_shape": null, 
          "mode": "sum"
        }, 
        "name": "merge_6"
      }, 
      {
        "class_name": "BatchNormalization", 
        "inbound_nodes": [
          [
            [
              "merge_6", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "gamma_regularizer": null, 
          "name": "batchnormalization_13", 
          "epsilon": 0.001, 
          "trainable": true, 
          "mode": 0, 
          "beta_regularizer": null, 
          "momentum": 0.99, 
          "axis": 1
        }, 
        "name": "batchnormalization_13"
      }, 
      {
        "class_name": "Activation", 
        "inbound_nodes": [
          [
            [
              "batchnormalization_13", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "activation": "relu", 
          "trainable": true, 
          "name": "activation_13"
        }, 
        "name": "activation_13"
      }, 
      {
        "class_name": "Convolution2D", 
        "inbound_nodes": [
          [
            [
              "activation_13", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "W_constraint": null, 
          "b_constraint": null, 
          "name": "convolution2d_16", 
          "activity_regularizer": null, 
          "trainable": true, 
          "dim_ordering": "th", 
          "nb_col": 3, 
          "subsample": [
            2, 
            2
          ], 
          "init": "he_normal", 
          "bias": true, 
          "nb_filter": 512, 
          "b_regularizer": null, 
          "W_regularizer": {
            "l2": 9.999999747378752e-05, 
            "name": "L1L2Regularizer", 
            "l1": 0.0
          }, 
          "nb_row": 3, 
          "activation": "linear", 
          "border_mode": "same"
        }, 
        "name": "convolution2d_16"
      }, 
      {
        "class_name": "BatchNormalization", 
        "inbound_nodes": [
          [
            [
              "convolution2d_16", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "gamma_regularizer": null, 
          "name": "batchnormalization_14", 
          "epsilon": 0.001, 
          "trainable": true, 
          "mode": 0, 
          "beta_regularizer": null, 
          "momentum": 0.99, 
          "axis": 1
        }, 
        "name": "batchnormalization_14"
      }, 
      {
        "class_name": "Activation", 
        "inbound_nodes": [
          [
            [
              "batchnormalization_14", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "activation": "relu", 
          "trainable": true, 
          "name": "activation_14"
        }, 
        "name": "activation_14"
      }, 
      {
        "class_name": "Convolution2D", 
        "inbound_nodes": [
          [
            [
              "merge_6", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "W_constraint": null, 
          "b_constraint": null, 
          "name": "convolution2d_18", 
          "activity_regularizer": null, 
          "trainable": true, 
          "dim_ordering": "th", 
          "nb_col": 1, 
          "subsample": [
            2, 
            2
          ], 
          "init": "he_normal", 
          "bias": true, 
          "nb_filter": 512, 
          "b_regularizer": null, 
          "W_regularizer": {
            "l2": 9.999999747378752e-05, 
            "name": "L1L2Regularizer", 
            "l1": 0.0
          }, 
          "nb_row": 1, 
          "activation": "linear", 
          "border_mode": "valid"
        }, 
        "name": "convolution2d_18"
      }, 
      {
        "class_name": "Convolution2D", 
        "inbound_nodes": [
          [
            [
              "activation_14", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "W_constraint": null, 
          "b_constraint": null, 
          "name": "convolution2d_17", 
          "activity_regularizer": null, 
          "trainable": true, 
          "dim_ordering": "th", 
          "nb_col": 3, 
          "subsample": [
            1, 
            1
          ], 
          "init": "he_normal", 
          "bias": true, 
          "nb_filter": 512, 
          "b_regularizer": null, 
          "W_regularizer": {
            "l2": 9.999999747378752e-05, 
            "name": "L1L2Regularizer", 
            "l1": 0.0
          }, 
          "nb_row": 3, 
          "activation": "linear", 
          "border_mode": "same"
        }, 
        "name": "convolution2d_17"
      }, 
      {
        "class_name": "Merge", 
        "inbound_nodes": [
          [
            [
              "convolution2d_18", 
              0, 
              0
            ], 
            [
              "convolution2d_17", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "name": "merge_7", 
          "concat_axis": -1, 
          "output_shape_type": "raw", 
          "mode_type": "raw", 
          "dot_axes": -1, 
          "output_mask_type": "raw", 
          "arguments": {}, 
          "output_mask": null, 
          "output_shape": null, 
          "mode": "sum"
        }, 
        "name": "merge_7"
      }, 
      {
        "class_name": "BatchNormalization", 
        "inbound_nodes": [
          [
            [
              "merge_7", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "gamma_regularizer": null, 
          "name": "batchnormalization_15", 
          "epsilon": 0.001, 
          "trainable": true, 
          "mode": 0, 
          "beta_regularizer": null, 
          "momentum": 0.99, 
          "axis": 1
        }, 
        "name": "batchnormalization_15"
      }, 
      {
        "class_name": "Activation", 
        "inbound_nodes": [
          [
            [
              "batchnormalization_15", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "activation": "relu", 
          "trainable": true, 
          "name": "activation_15"
        }, 
        "name": "activation_15"
      }, 
      {
        "class_name": "Convolution2D", 
        "inbound_nodes": [
          [
            [
              "activation_15", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "W_constraint": null, 
          "b_constraint": null, 
          "name": "convolution2d_19", 
          "activity_regularizer": null, 
          "trainable": true, 
          "dim_ordering": "th", 
          "nb_col": 3, 
          "subsample": [
            1, 
            1
          ], 
          "init": "he_normal", 
          "bias": true, 
          "nb_filter": 512, 
          "b_regularizer": null, 
          "W_regularizer": {
            "l2": 9.999999747378752e-05, 
            "name": "L1L2Regularizer", 
            "l1": 0.0
          }, 
          "nb_row": 3, 
          "activation": "linear", 
          "border_mode": "same"
        }, 
        "name": "convolution2d_19"
      }, 
      {
        "class_name": "BatchNormalization", 
        "inbound_nodes": [
          [
            [
              "convolution2d_19", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "gamma_regularizer": null, 
          "name": "batchnormalization_16", 
          "epsilon": 0.001, 
          "trainable": true, 
          "mode": 0, 
          "beta_regularizer": null, 
          "momentum": 0.99, 
          "axis": 1
        }, 
        "name": "batchnormalization_16"
      }, 
      {
        "class_name": "Activation", 
        "inbound_nodes": [
          [
            [
              "batchnormalization_16", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "activation": "relu", 
          "trainable": true, 
          "name": "activation_16"
        }, 
        "name": "activation_16"
      }, 
      {
        "class_name": "Convolution2D", 
        "inbound_nodes": [
          [
            [
              "activation_16", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "W_constraint": null, 
          "b_constraint": null, 
          "name": "convolution2d_20", 
          "activity_regularizer": null, 
          "trainable": true, 
          "dim_ordering": "th", 
          "nb_col": 3, 
          "subsample": [
            1, 
            1
          ], 
          "init": "he_normal", 
          "bias": true, 
          "nb_filter": 512, 
          "b_regularizer": null, 
          "W_regularizer": {
            "l2": 9.999999747378752e-05, 
            "name": "L1L2Regularizer", 
            "l1": 0.0
          }, 
          "nb_row": 3, 
          "activation": "linear", 
          "border_mode": "same"
        }, 
        "name": "convolution2d_20"
      }, 
      {
        "class_name": "Merge", 
        "inbound_nodes": [
          [
            [
              "merge_7", 
              0, 
              0
            ], 
            [
              "convolution2d_20", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "name": "merge_8", 
          "concat_axis": -1, 
          "output_shape_type": "raw", 
          "mode_type": "raw", 
          "dot_axes": -1, 
          "output_mask_type": "raw", 
          "arguments": {}, 
          "output_mask": null, 
          "output_shape": null, 
          "mode": "sum"
        }, 
        "name": "merge_8"
      }, 
      {
        "class_name": "BatchNormalization", 
        "inbound_nodes": [
          [
            [
              "merge_8", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "gamma_regularizer": null, 
          "name": "batchnormalization_17", 
          "epsilon": 0.001, 
          "trainable": true, 
          "mode": 0, 
          "beta_regularizer": null, 
          "momentum": 0.99, 
          "axis": 1
        }, 
        "name": "batchnormalization_17"
      }, 
      {
        "class_name": "Activation", 
        "inbound_nodes": [
          [
            [
              "batchnormalization_17", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "activation": "relu", 
          "trainable": true, 
          "name": "activation_17"
        }, 
        "name": "activation_17"
      }, 
      {
        "class_name": "BatchNormalization", 
        "inbound_nodes": [
          [
            [
              "activation_17", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "gamma_regularizer": null, 
          "name": "batchnormalization_18", 
          "epsilon": 0.001, 
          "trainable": true, 
          "mode": 0, 
          "beta_regularizer": null, 
          "momentum": 0.99, 
          "axis": 1
        }, 
        "name": "batchnormalization_18"
      }, 
      {
        "class_name": "Activation", 
        "inbound_nodes": [
          [
            [
              "batchnormalization_18", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "activation": "relu", 
          "trainable": true, 
          "name": "activation_18"
        }, 
        "name": "activation_18"
      }, 
      {
        "class_name": "AveragePooling2D", 
        "inbound_nodes": [
          [
            [
              "activation_18", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "name": "averagepooling2d_1", 
          "trainable": true, 
          "dim_ordering": "th", 
          "pool_size": [
            1, 
            1
          ], 
          "strides": [
            1, 
            1
          ], 
          "border_mode": "valid"
        }, 
        "name": "averagepooling2d_1"
      }, 
      {
        "class_name": "Flatten", 
        "inbound_nodes": [
          [
            [
              "averagepooling2d_1", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "trainable": true, 
          "name": "flatten_1"
        }, 
        "name": "flatten_1"
      }, 
      {
        "class_name": "Dense", 
        "inbound_nodes": [
          [
            [
              "flatten_1", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "W_constraint": null, 
          "b_constraint": null, 
          "name": "dense_1", 
          "activity_regularizer": null, 
          "trainable": true, 
          "init": "he_normal", 
          "bias": true, 
          "input_dim": 512, 
          "b_regularizer": null, 
          "W_regularizer": null, 
          "activation": "linear", 
          "output_dim": 10
        }, 
        "name": "dense_1"
      }, 
      {
        "class_name": "Activation", 
        "inbound_nodes": [
          [
            [
              "dense_1", 
              0, 
              0
            ]
          ]
        ], 
        "config": {
          "activation": "softmax", 
          "trainable": true, 
          "name": "activation_19"
        }, 
        "name": "activation_19"
      }
    ], 
    "input_layers": [
      [
        "input_1", 
        0, 
        0
      ]
    ], 
    "name": "model_1", 
    "output_layers": [
      [
        "activation_19", 
        0, 
        0
      ]
    ]
  }
}